[
{"title": "Доработать бота для  крипто-арбитража", "price": "15 000 руб. за проект", "description": "Добрый день! Проект связан с доработкой бота, тестирующего гипотезу об арбитраже между крипто-биржами.\nСам механизм хорошо описан вот здесь: https://holtzy.github.io/Crypto-Arbitrage/ (автор наглядно объясняет как работает арбитраж и зачем нужен ребаланс)\n\nБот, разработанный на данный момент представляет собой несколько модулей, работающих параллельно:\n1) Вебсокеты, которые занимаются поставкой данных с крипто-бирж;\n2) Калькуляторы - рассчитывают разницы в ценах для всех валют и пар бирж;\n3) Мониторинг - следит за списком вилок и выполняет её в случае, если попалась выгодная вилка;\n4) Пуш - обновление дополнительных данных с бирж, недоступных через вебсокет;\n5) Ребалансировка - обратное исполнение сделки, модуль похож на мониторинг;\n6) Телеграм - бот - поставляет статистику о работе биржевого бота и исполненных сделках;\n\nБот написан на Python\n\nКакие задачи нужно выполнить:\n1) Исправить проблему, что сделки на бирже Bibox не приходят, скорее всего обновилось API;\n2) Добавить функцию сбора статистики, доработать модуль расчета теоретической доходности;\n3) Добавить 2 новых биржи (много функционала для новых бирж уже есть - rest api, некоторые вебсокеты);\n\nПредварительно описанный объем задач оцениваем примерно в 15-20 часов.\nВ дальнейшем интересует долгосрочная работа по тестированию, поддержке и развитию бота.\nОт исполнителя хотелось бы представления о работе крипто-бирж, опыта работы с арбитражом, опыта работы с API бирж.\n\nПишите в откликах ваш опыт работы в данной области, приходилось ли решать подобные задачи, подключаться к биржам, итд.\nПредпочтительный метод связи - Telegram\n", "link": "https://freelansim.ru/tasks/263057"},
{"title": "P0f &amp; OS  Fingerprinting", "price": "8 000 руб. за проект", "description": "Есть группа пользователей, работающих на андройде с социальной сетью facebook и использующих собственные прокси сервера. Собственные прокси располагаются на centos сервере с установленным squd, также, на нем есть python скрипт под p0f, который пропускает трафик идущий по TCP протоколу через себя, меняя/добавляя в содержимое пакетов косвенные признаки OS Android.\nНа данный момент, сравнивая работу через домашнюю сеть wifi и через собственные прокси, имеется ощутимая разница в работе. При использовании собственных прокси facebook постоянно блокирует аккаунты наших работников и просит подтвердить их.\nЗадачи.\n1. Сравнить косвенные признаки (OS FingerPrint) отправляемые от \"нормального клиента\" и от клиента работающего через наш прокси сервер.\n2. Изменить пакеты, проходящие через наш прокси сервер, что бы они имели такие-же косвенные признаки, как и пакеты, отправляемые с клиента, не использующего прокси сервер.\nЕсли необходимо, мы готовы выделить тестовые сервер(а) и подсети.\n", "link": "https://freelansim.ru/tasks/261907"},
{"title": "Разработать личный кабинет  (фулстак)", "price": "150 000 руб. за проект", "description": "Требуется: разработать личный кабинет финтех проекта. Форма входа, прикрутить платежные системы, интегнация и автоматизация.\n\nМесто: Киев (желательно быть в одном городе, что бы проводить совещания вживую)\n\nУровень: middle и выше.\n\nОбязательное условие - английский не ниже среднего (тимлид не говорит по русски)\n\nКлючевые слова: #java, #pyton, #JavaScript, #ReactNative, #Xcode\n\nТребумые навыки\nГлубокое понимание объектно-ориентированного программирования и опыт работы с Java, Java, многопоточным и асинхронным программированием.\nЗнакомство со скриптами PythonТвердое понимание структур данных, алгоритмов и сложностиОпыт разработки RESTFUL веб-сервисов с JavaОпыт работы с БД Монго\nГотовность изучать Scala и рамки Akka за короткий промежуток времени\nОпыт написания комплексных JUnit-тестов и макетов, таких как Mockito\n\nТестовое задание обязательно (три вопроса)\n", "link": "https://freelansim.ru/tasks/262057"},
{"title": "Разработать бот интернет-магазин в  telegram", "price": "100 000 руб. за проект", "description": "Создать интернет-магазин или каталог с товарами с возможностью выбора города, категории, типа товара и платежной системы\nДобавить возможность в удобном формате менять весь ассортимент\n", "link": "https://freelansim.ru/tasks/261657"},
{"title": "Скрипт для массовой рассылки сообщений по группам чатам в  telegram", "price": "100 000 руб. за проект", "description": "Необходимо написать скрипт для массовой рассылки сообщений по группам/чатам в телеграм. Группы/чаты вбиваются списком\n", "link": "https://freelansim.ru/tasks/261655"},
{"title": "Python + Django - интегрировать новую верстку и новый  функционал", "price": "500 руб.за час", "description": "Здравствуйте,\nЕсть обычный портал,\n1. для него делаем новый диз и верстку, надо будет интегририровать в проект, так что желательно хорошо знать фронт.\n2. Добавлять новый функционал\nтехнологии:\n- Python, Django, Docker, RDS, css, html, js, react\nбудем рады хорошему человеку!\n\n", "link": "https://freelansim.ru/tasks/262129"},
{"title": "Требуется mid\\senior python на фулл  тайм", "price": "150 000 руб. за проект", "description": "Приглашаем в нашу команду ориентированного на высокое качество кода разработчика Python.\nРазвернуть разработку приложения для телеграм со следующим функционалом\n> Инвайтинг > Сообщения\n> Просмотры > Вступления\n> Выход > Жалобы\n> Звонки > Парсинг\n> Регистрация\n- опыт разработки на Python (от 3-х лет)\n(будет плюсом если уже были разработки по телеге, особенно если это парсерсы, регистраторы сессий, также плюсом будет опыт декомпиляции и выдергивания информации с приложений )\n- знакомство с Docker, Git\n- работа с базами данных\n- опыт многопоточного и асинхронного программирования\n- готовность взять на себя ответственность за разработку с нуля, качественные и беспербойные релизы, привносить позитивные практики разработки\n- Умение и желание быстро разбираться в новом\n- Участие в создании крутого продукта от которого будут кайфовать все\n- На начальном этапе удаленка, далее миграция в офис на фулл тайм (офис 5/2 с гибким началом рабочего дня;) Расположение офиса: w plaza (М.Тульская) Москва\n- Заработная плата целиком и полностью зависящая от твоих навыков.\nPS: Ищутся кандидаты только с опытом, начинающих просьба не беспокоить.\nНачните отклик с текущего дня недели)\n\n", "link": "https://freelansim.ru/tasks/261783"},
{"title": "Доработка на  Python", "price": "Цена договорная", "description": "Нужно к готовому сайту на Python сделать правки .\nА именно натянуть на новую копию сайта дизайн .\nПо функционалу ничего не нужно менять только визуальная часть .\nОставляйте в отклике контакты для связи .\n\n", "link": "https://freelansim.ru/tasks/262021"},
{"title": "Python-разработчик на  проект", "price": "Цена договорная", "description": "Для разработки проекта (1 месяц) ищется разработчик:\n- Опыт веб-разработки от одного года, программирования не менее трёх лет.\n- Умения разбираться в чужом коде.\n- Опыт разработки сложных проектов.\n- Опыт работы с django 2.*, python 3.7\n- Знание SQL (в частности, PostgreSQL) и умение оптимизировать запросы.\n- Умение составлять сложные SQL-запросы\n- Знание регулярных выражений.\n- Знание HTML/CSS/JS на базовом уровне.\n- Английский язык на техническом уровне.\nтелеграмм: @pvtq77\n", "link": "https://freelansim.ru/tasks/262139"},
{"title": "Разработать систему интеллектуального разбора документов на  Python", "price": "Цена договорная", "description": "Ищется разработчик Python для разработки в проект заказной разработки.\nОтличное знание Python(>3.6), ООП, паттернов проектирования.\nНаличие реализованных проектов на Python.\nЗнание реляционных СУБД и языка SQL.\nОпыт работы в ОС Linux (Debian/Ubuntu) на уровне пользователя, также базовые знания на уровне программиста.\nЗнанием систем контроля версий и умение с ними работать(git).\nПрефернеции - офис parttime MSK (2 рабочих дня)\nи\nremote (3 рабочих дня в неделю) с фикс графиком работы от 8 часов в день (в т.ч. доступности по телеграм, телефону, видеоконф).\nРабота совместно с другими программистами в команде под управлением проектного менеджера.\nПри положительном опыте работа по другим проектам.\n", "link": "https://freelansim.ru/tasks/262173"},
{"title": "Нужен сильный python разработчик с  Москвы", "price": "300 000 руб. за проект", "description": "Нужен сильный питон разработчик\\команда с Москвы (на проект по телеге (парсеры\\регеры)\nНачните отклик с любого цвета\n", "link": "https://freelansim.ru/tasks/261901"},
{"title": "Скриптом на Ruby или Python заполнять .xlsx  шаблон", "price": "Цена договорная", "description": "\nСтруктура данных в хеше примерно такая (можно изменить, если это упростит)\n\n", "link": "https://freelansim.ru/tasks/262317"},
{"title": "Разработка Saas решения верстка, front и  backend", "price": "400 000 руб. за проект", "description": "Приветствую всех!\nИщем Full stack разработчика, либо front end и back end разработчика поотдельности для проекта\nСтэк: - Vue.js - React.js - Node.js - Python. Плюс нужен врестальщик, хорошо если фронт и верстальщик это один человек, так удобнее будет работать.\nДелаем Saas решение, интересный проект, с продолжением и постоянным обновлением релизов.\nНачинается второй этап проекта, первый почти запустили. В ближайшие пару недель планируем начинать.\nИщем профессионалов своего дела, кто не срывает сроки, ответственно подходит к делу, внимателен к написанию кода, кто ищет интересный проект, понимает как улучшить архитектуру сервиса.\nНеобходимы ваши кейсы\n", "link": "https://freelansim.ru/tasks/262445"},
{"title": "Написать бота в Телеграм на  Python", "price": "25 000 руб. за проект", "description": "\n\n", "link": "https://freelansim.ru/tasks/262285"},
{"title": "Разработать модули процессинговой системы/уровень  Senior", "price": "100 000 руб. за проект", "description": "ReactivePay – предоставляет высокотехнологичные услуги в сфере программного обеспечения для банков, бирж, платежных сервис-провайдеров и корпоративных клиентов по всему миру.\nЛокация: Москва\nПроектная работа с ориентиром на результат\nФормат работы: удаленная работа или работа в офисе по желанию\nЗанятость: full time,\nКомпенсация: по договоренности и объему работ, готовы обсуждать\nСТЭК\nНеобходимый опыт работы:\nTeamLead / Backend developer\n• Разработка на Ruby on Rails, Python Django\n• PostgreSQL, mongoDB\n• Знание Docker (swarm cluster)\n• Владение Ansible как преимущество\n• Работа с CI/CD pipeline. (gitlab, teamcity)\n• VSC (git + GitLab)\n• Опыт работы в PCI DSS окружениях как плюс\nЗадачи:\nРазработка модулей процессинговой системы, управление командой разработки (3+ специалиста), правильная постановка задач и распределение между участниками команды, их оценка, выполнение в срок.\nЛичностные качества:\nЖелание работать, высокая степень ответственности и серьезный подход к работе;\nУмение работать самостоятельно и грамотно решать технические задачи;\nУмение выполнять работу качественно и в согласованные сроки;\nУсловия:\nКонкурентоспособное и своевременное вознаграждение;\nВозможно длительное взаимодействие с проектом;\nЮридическое оформление отношений –ИП, самозанятые;\nРастущий и интересный проект с сильными наставниками;\nНикакой бюрократии, комфортный рабочий процесс, лояльное руководство и своевременная обратная связь по рабочим процессами\nОфис в пешей доступности от м. Таганская\nДля оперативной связи контактный телеграмм указан в профиле.\n", "link": "https://freelansim.ru/tasks/262567"},
{"title": "Программист со знанием Django Rest Framework и  VUE", "price": "Цена договорная", "description": "Требуется программист для доработки (переработки) проекта.\nЗадачи:\nДоработка (переработка) модулей с использованием Django Rest Framework.\nСоздание интерфейса с помощью VUE.\nРабота в команде.\nОплата по договоренности.\n", "link": "https://freelansim.ru/tasks/262473"},
{"title": "Нужен парсер сайта python или  php", "price": "3 000 руб. за проект", "description": "Нужен парсер сайта hdfilme cc\nНа сайте есть клауд.\nЧто и куда спарсить расскажу в личной переписке.\nПарсер должен быть консольный под систему линукс.\n\n", "link": "https://freelansim.ru/tasks/262695"},
{"title": "Необходимо доработать  Python-библиотеку", "price": "Цена договорная", "description": "Необходимо доработать Python-библиотеку (pygame)\nТребования к исполнителю:\n-Опыт работы с python 3х от 3х лет\n-Знания стека : python 3.6, pygame\nДетали задачи будут высланы при отклике.\n", "link": "https://freelansim.ru/tasks/262761"},
{"title": "Написать интеграцию платежных API на  Python", "price": "Цена договорная", "description": "Необходимо написать интеграцию платежных API на Python.\nРабота проектная.\nНачало проекта - сразу после договоренности.\nНеобходим ответственный, адекватный исполнитель, который оценит работы по ТЗ и качественно выполнит задание.\n\n", "link": "https://freelansim.ru/tasks/262563"},
{"title": "Разработка  утилиты", "price": "3 000 руб.за час", "description": "Нужно разработать утилиту с примерно такой логикой работы:\n\n\n\n\nЕсть сайт, который позволяет просматривать вебинары, они там лежат в формате \"по частям\": отдельно видео, отдельно презентация картинками, отдельно чат текстом и т.д.\n\n\nСуть утилиты - собрать эти части в одно цельное видео, получив на вход URL вебинара.\n\n\n\n\nВопрос со звездочкой: некоторые ссылки защищены авторизацией, нужно научить эту утилиту авторизовываться в том числе.\n\n\n\n\nУ нас есть частичное решение на python3, эти наработки могут помочь.\n\n\n\n\nВидео с результатом нужно сохранить в файл и сохранить в СУБД (любую, на выбор) соответствие оригинальной ссылки и этого видео.\n\n\n\n\nТакже, утилита должна уметь принимать вход не только ссылку на вебинар, но и файл с ссылками (1 ссылка на строку). При этом нужно избежать возможных дублей (СУБД с результатами в этом может помочь).\n\n\n\nВсего 17 тысяч роликов по 90 минут.\n\n\n\nСсылка на тестовый вебинар:\n\n", "link": "https://freelansim.ru/tasks/262915"},
{"title": "Нужно сменить тип решения капчи с proxyless на proxy,  прокинув", "price": "2 000 руб. за проект", "description": "Есть постеры.\nНужно сменить тип решения капчи с proxyless на proxy, прокинув в метод прокси, который используется в постере, порты прокинуты через Iptables, в антигейт надо передавать ip сервера(144.....) и порт по номеру прокси\n", "link": "https://freelansim.ru/tasks/262775"},
{"title": "Frontend на Vue (Vuex, Nuxt), с Rest api на  python(Jango)", "price": "Цена договорная", "description": "Относительно большой проект.\nСо стороны фронтенда Vue (Vuex, Nuxt).\nАрхитектура основана на получении с сервера метаданных и их интерпретация на фронтенде.\nПример общего подхода:\nНастраиваем таблицы, кнопки, и т.д.\nБекенд сообщает о себе всю информацию, фронтенд строит интерфейс в соответствии с ней.\nДизайн минималисткий, типа bootstrap\nСо стороны бекенда\nDynamic REST  (Dynamic API extensions for Django REST Framework)\nРасcчитываем на долговременное сотрудничество.\nТЗ кандидатам после предварительного общения.\n\n", "link": "https://freelansim.ru/tasks/262959"},
{"title": "Full-stack (front-end и/или back-end) Ruby, Go, Python, Elixir,  Nodejs", "price": "2 000 руб.за час", "description": "Нужно сделать аналог личного кабинета по меню и объектам (кроме - helps, reports), которые находиться на сайте gremlin.com (нужен vpn). Не нужно делать функционал сайта-донора, достаточно сделать заглушки, которые будут сохранять объекты в БД (грубо говоря CRUD по каждому объекту, но с правильными вьюхами). Код должен быть протестирован.\nТехнологический стек предлагайте. Работать будем на GitHub. Нужно настроить Travis CI и упаковать в docker’ы. API должно быть задокументировано.\nАрхитектура должна быть следующей, один сервис с nginx + front, второй app back + база.\nЗадачу можно разделить на две части (то есть можете сделать что-то одно), предлагайте план реализации, срок и стоимость:\nцена вопроса указана от балды.\nОбсуждаем предложения по существу telegram @chernykh_alexander\n", "link": "https://freelansim.ru/tasks/262829"},
{"title": "Разработка веб-сервиса на  Django", "price": "700 руб.за час", "description": "Ищем толкового python-разработчика в большой проект. Проект на начальной стадии — есть ТЗ и системные требования. Предстоит разработать систему для работы с российскими и международными стандартами. На текущем этапе нужно активно участвовать в работе над архитектурой будущей системы.\nТребования:\nБудет плюсом:\n\n", "link": "https://freelansim.ru/tasks/262995"},
{"title": "Разработка интерфейса с картой для системы построения  маршрутов", "price": "1 200 руб.за час", "description": "Ищется два разработчика: front-end и back-end, или один разработчик full-stack.\nПлюсом будет интерес к математике (работа с графами), но это не обязательно.\nОбщее описание ТЗ во вложении в формате PDF.\nВсе подробности по задаче и данным будут уточнены до или в процессе разработки.\nТехнологический стек:\nFrontend: React + Redux\nДля карты используется mapbox\nBackend: Python, Django\nСУБД: PostgreSQL\nGit\nDocker\nПредполагается оплата по системе time&material: краткие отчёты о потраченном времени, оплата по ставке за час работы.\nПо организации работы: для общения используем slack или telegram, для постановки задач trello.\nВозможна работа по безопасной сделке и/или по договору.\nДружелюбную атмосферу, поддержку, тестирование и интересный проект – обеспечим.\n", "link": "https://freelansim.ru/tasks/261653"},
{"title": "Скомпоновать из множества мелких файлов в один большой ворд  файл", "price": "700 руб. за проект", "description": "1-й скрипт:\nВ папке лежит 1000 файлов docx. Все они разного размера.\nНужно взять первый файл docx и дополнить его содержимое содержимым последующих файлов пока он не станет содержать в себе примерно 2.6 миллиона символов без пробелов (по ворду).\nИспользованные файлы удалить. Затем продолжить выполнение, т.е. взять следующий файл из этой папки и дополнить его до примерно 2.6 миллиона символов без пробелов (по ворду) и так пока не закончатся файлы в папке.\n2-й скрипт:\nБерет название файла и вставляет в документ docx в самое начало. Выравнивает его по середине страницы, выделяет жирным и выбирает нужный размер.\nНужно начать делать сейчас. Пишите на каком языке будете писать и когда будет готово.\nЖелательно, чтобы было готово чем быстрее тем лучше.\n", "link": "https://freelansim.ru/tasks/262891"},
{"title": "Провести анализ возможности транслировать треки с soundcloud на  сайте", "price": "Цена договорная", "description": "На soundcloud можно транслировать треки используя их API\nНо для этого нужен CLIENT ID, а регистрация новых приложений у них сейчас закрыта.\nID и ключи есть в мобильном приложении, но этот вариант скорее для поиграться с API в песочнице.\nНужно проанализировать возможности осуществления, вариант с виджетом не подходит, т.к. нужно будет транслировать через свой плеер, по которому тоже будут задачи.\n", "link": "https://freelansim.ru/tasks/261139"},
{"title": "Доработать бэк и фронтальную часть аналитического  решения", "price": "80 000 руб. за проект", "description": "Необходимо доработать бэк и фронт часть аналитического решения. Бэк/фронт примерно 30/70.\nИспользуемый стэк Python 3: Django. JavaScript: Vue.js как фронтэенд, графики рисуем на Highcharts. БД на mySQL.\nВкратце что реализовано:\nИз нескольких открытых источников типа newsapi.org по открытым API загружаются новости по определенным компаниям, размещаются в БД, далее обрабатываются по определенной логике - проставляются определенные признаки новостям (это внешний движок, в задачу не входит), после этого формируется несколько вариантов отчетов. Детали могу дать лично в почту в случае интереса.\nНадо доработать:\nБэк: увеличить частоту выгрузки новостей из источников, реализовать второй вариант проставления атрибутов (сейчас логика во внешнем движке одна, теперь будет на выбор два варианта обработки), добавить несколько настроек для передачи во внешний движок.\nФронт: доработать навигацию между отчетами (агрегированный по группам компаний -> детальный по группе компаний - проваливание в конкретную компанию и обратно по цепочке).\nОценка необходимых трудозатрат - около 6-8 человеко-дней.\nЕсли сработаемся - есть еще фронт работ на столько же. Потом есть перспективы развития системы - может быть уже больше задач.\nВ приложении пара картинок, скорее всего надо давать комментарии.\n\n", "link": "https://freelansim.ru/tasks/261349"},
{"title": "Переработка существующей  ERP", "price": "Цена договорная", "description": "Нужна команда - переделать внутреннее веб-приложение в продукт на продажу (\"коробку\").\nЗадача: подготовить существующий софт (ERP, заточенная под определенную отрасль) под будущую продажу клиентам (установка на сервера клиентов их силами, закрытый исходный код, возможность разделения на версии Lite и Pro, ограничения тестового периода и количества пользователей).\nНынешние технологии: БД Mongo, бэк-енд Python, фронт Javascript + Vue.js\nРассматриваем различные варианты – и переписать с нуля на компилируемом языке; и провести рефакторинг нынешнего кода + трансформировать в закрытый методом, не позволяющим провести обратную операцию (Cython или др.методы).\nВместо подробного ТЗ есть: аналитик и разработчик,\nработавшие над проектом с самого начала, на связи и готовы ответить на любые\nвопросы; развернем демо-сервер, на который можно ориентироваться; документация\nдля администраторов и пользователей; исходный код.\nКраткое описание системы в приложении.\nПолное тестирование продукта – на вашей стороне. В дальнейшем планируется сотрудничество для поддержки и доработки продукта.\nПросьба оценить сроки и стоимость, указав технологии, которыми будете пользоваться.\n\n", "link": "https://freelansim.ru/tasks/261305"},
{"title": "Сделать документ  CSV", "price": "2 000 руб. за проект", "description": "Требуется сделать скрипт, который будет из данных из плоской таблицы формировать другие таблицы.\n\nПример исходных данных в файле в листе \"data\"\nПример финальных данных в файле во всех остальных листах.\n\n\nЭто стандартный отчет, который всегда будет наполняться разным количеством данных, алгоритм должен быть адаптивен к любым вариациям набора данных.\n\n\nАлгоритм должен забирать данные из листа таблицы с определенным названием и раскидывать обработанные данные по другим листам.\n\n\nПодробнее давайте в ЛС.\n\n", "link": "https://freelansim.ru/tasks/261353"},
{"title": "Доработать бота в  ТГ", "price": "Цена договорная", "description": "Есть проект(бот в телеграмме), текущий разработчик не вывозит, очень долго делает. Нужен специалист, который сможет разобраться в коде на Python и базе данных mongoDB, кода много и есть не до конца доведённая часть. Все подробности конечному исполнителю.\n\nСейчас ищем опытного специалиста, который готов подтвердить свою квалификацию кейсами и пояснить что и как выполнял. Ниже опишите свой опыт и примеры работ, без них кандидатов не рассматриваю!\n", "link": "https://freelansim.ru/tasks/258601"},
{"title": "Разработка API на  python/django-rest-framework", "price": "Цена договорная", "description": "Нужен python разработчик на проектной основе для реализации API к мобильным и веб приложениям.\nС чем придется столкнуться в работе:\nВопросы к кандидату:\n\n", "link": "https://freelansim.ru/tasks/259051"},
{"title": "Фронт-енд разработчик (JS, Bootstrap  etc.)", "price": "700 руб.за час", "description": "Нужен фронтенд разработчик со знанием Javascript (ES6), умением верстать (Bootstrap), знанием хотя бы одного из современных фреймворков (React/Redux, Vue.js/Nuxt.js, Angular). Плюсом будет понимание работы бэкенда и чтение кода на Python/Django.\nДля работы над CRM рекламного агенства.\nПосле первого спринта готовы увеличивать оклад в случае хороших результатов совместной работы.\n", "link": "https://freelansim.ru/tasks/259077"},
{"title": "Python  разработчик", "price": "500 руб.за час", "description": "Необходим python-разработчик на проект по разработке серверной части для самописной системы. Работа командная. Оплата по time material. Часовая ставка указана в проекте. Проект долгосрочный.\n", "link": "https://freelansim.ru/tasks/259469"},
{"title": "PHP или Python скрипт - найти рейндж выбранного  цвета", "price": "Цена договорная", "description": "Нужно разработать скрипт на бекенде отдельно взятой функции для сайта.\nБекенд у нас на ларавель, функцию писать с нуля не следует, нужно найти библиотеку и запилить с ее помощью то что нам нужно, а нам нужно:\nНайти рендж выбранного цвета, уделив внимание краям, сделать чб картинку выделенного участка, на основании выделяемого пользователем цвета.\nПосле того как пользователь нажал на цвет (ткнул в середину) на фронтэнде сейчас мы берем этот цвет и выделяем область этого цвета. На бекенде надо сделать тоже самое, только очень-очень аккуратно и с картинкой иного 10000х5000пх! с вниманием к краям, сохраняя ЧБ-изображение в базу данных.\nМы нашли несколько библиотек на питоне которые кажется могут это сделать:\nhttps://ru.stackoverflow.com/questions/664361/Найти-range-одного-цвета-на-изображении\nЖелательно найти на ПХП, так как бекенд на пхп, но можно и на питоне сообразить..\nВообще, круто будет если вы молодой амбициозный прогер и был бы непротив принять участие в дальнейше разработке.\nСайт стартапа archholder.com\n\n", "link": "https://freelansim.ru/tasks/259783"},
{"title": "Разработать страницу расписания на уже готовом  проекте", "price": "600 руб.за час", "description": "Проект написан на:\nФронтенд – React + Flux.\nБекенд – Python + Django.\nМакеты в Zeplin.\nЗдесь прикрепляю PNG.\nНужно:\n- Создать две новые страницы\n- Один компонент расписания\n- Добавить недостающие данные с бекенда\nНапишите, пожалуйста, в комментариях оценку сроков и ссылки на ваши примеры работ.\n", "link": "https://freelansim.ru/tasks/260845"},
{"title": "Написать тест-утилиту на основе tcpdump лога  атаки", "price": "Цена договорная", "description": "Клиент-серверное приложение подвергалось неизвестному типу сетевой атаки по протоколу tcp.\nатакующий отправляет ack запрос серверу, но делает это с множества чужих серверов (Бразилия и прочие страны).\nатакующий отправляет syn запрос dns серверу с подменненым содержимым (в виде обратного IP адреса и порта жертвы)\nпроанализировать предоставленные логи, убедиться/опровергнуть теорию выше, написать тест утилиту этой атаки.\nЛоги:\nТелеграмм: ionotrop\n\n", "link": "https://freelansim.ru/tasks/259861"},
{"title": "Python-скрипт парсинга и  REST-отдачи", "price": "3 000 руб. за проект", "description": "Необходим python-скрипт в docker-контейнере для выкачивания данных с сайта и отдачи данных по http.\nREADME с инструкцией: настройки, запуск, обновление, перезапуск, обнуление.\n\nПаук:\n1. Авторизация на сайте через учётную запись и получение информации в JSON. Есть пример в Jupyter.\n2. Полученные данные сохранять в БД.\n3. Перед сохранением проверять наличие данных в БД по дате для исключения дубликатов.\n4. Данные хранятся постранично. Останавливать запрос данных при достижении имеющихся.\n5. Вход на сайт один раз в рабочий день в 10 утра по МСК. Оставить возможность управления расписанием.\n\nВеб-сервер:\n1. Сделать возможность получения данных REST при передаче токена в заголовках запроса по дате.\n\nУправление через docker compose. Сайт дам в переписке.\n\nВ отклике:\n* Наличие ИП.\n* Методы и порядок оплаты.\n*  Опыт, кратко.\n* Пакеты, которые планируете использовать\n", "link": "https://freelansim.ru/tasks/260519"},
{"title": "Разработка модулей на Python+Scrapy (долгосрочный  проект)", "price": "1 000 руб.за час", "description": "Нам необходимо получить определенный набор данных с различных туристических сайтов используя Scrapy.\n- завершённое высшее профильное образование\n- опыт разработки в Python\n- опыт работы с Scrapy\n- опыт обхода современных коммерческих защит от ботов (!!!)\n- возможность работать над проектом с понедельника по пятницу не менее 5 часов в день\n- привычка держать заказчика в курсе относительно текущего статуса задач и своевременно сообщать об изменении планов и рабочего графика\n- код должен быть написан на Python с использованием Scrapy, без использования селениума и т.п.\n- код должен быть написан в соответствии с ТЗ и нашим АПИ\n- код будет запускаться модулем самотестирования\n- код будет проходить Code Review на оптимальность\n- полная занятость (40 часов в неделю) в течение продолжительного времени\n- четко написанная документация и требования\n- шаблоны кода для облегчения разработки\nПроект подразумевает постоянную доступность в рабочее время (пн-пт). Детальное ТЗ будет доступно после подписания соглашения о неразглашении.\nНачните Ваш отклик с описания животных, которых Вы любите. Потом расскажите о своём образовании и опыте обхода защит от ботов.\n", "link": "https://freelansim.ru/tasks/261099"},
{"title": "Разработать back-end для сервиса доставки, и front-end  диспетчера", "price": "Цена договорная", "description": "\nИщем в команду\nдля участия в проекте автоматизации сервиса доставки согласно ТЗ и утвержденному дизайн-проекту. В составе команды нужно спроектировать и разработать:\n\n\n\n\n\n\n\nПриветствуем ИП и самозанятых.\n", "link": "https://freelansim.ru/tasks/260723"},
{"title": "Python Scrapy  parser", "price": "25 000 руб. за проект", "description": "US based company needs to parse a website with DDOS protection.\nThere is an existing code base which already does parsing of the website, but the process of parsing isn't stable enough. The data losing is happening sometimes.\nThe job order assuming to increase stability of data amount.\nThe main criteria for candidate is a good experience with Python, Scrapy and DevOps.\nThe price is not final and open to be discussed, depends on skills of the candidate.\nGood English is required.\n", "link": "https://freelansim.ru/tasks/260945"},
{"title": "Full stack разработчик Python/Django - Все Зоомагазины  города", "price": "40 000 руб. за проект", "description": "Full stack разработчик Python/Django - Все Зоомагазины города - 40к\nДобрый день, уважаемые фрилансеры.\nЗа 2+ недели работы предлагаем 40к рублей. Интересно?\nПроект – Каталог всех зоомагазинов города. Всего в проекте 25 страницы (включая Промо, 404 и т.п.).\nСсылка на скрины всех страниц для оценки функционала проекта :\nТребуется:\nВыполнить натяжку проекта (верстка уже готова) на Пайтон-Джанго - проработка бэка и админки полностью\n1 Этап. Проработка моделей и таблиц БД, создание миграций, простые unit тесты, репозитории и базовые методы\n2 Этап. Натяжка готовой вёрстки (использование вышеуказанных методов для поиска, фильтрации из фронтенда, работа с js, при необходимости мелкая доработка фронта)\n3 Этап. Доработка админки, заливка контента, оптимизация верстки по ГуглПэйджСпид и остальные вопросы\nПланируемые сроки и бюджет (дни календарные)\nЭтап-1 - 4 дня, этап-2 - 7 дней, этап 3 - 3 дня, итого - примерно 2 недели. При наличии у мастера достаточного опыта и собственных наработок (а не \"с нуля\").\nБюджет - ориентируемся на 40к. Этапы 1 и 2 - 50%, по завершению этапа-3 - остальные 50% общего бюджета (Это чтобы Вы не бросили проект \"по семейным обстоятельствам\" на середине)\nЕсли Вас заинтересовал наш проект, от Вас:\n1. Ваш опыт работы на уровне full stack разработчика Пайтон-Джанго (лет)\n2. ссылка на 3 последние реализованные проекта (именно на Пайтон-Джанго)\n3. Ваши предложения по бюджету/срокам реализации Этапа 1, Этапа-2, проекта в целом.\n4. стоимости 1 часа Вашей работы (для последующих доработок, если вдруг потребуется).\nВнимание! Предоплаты не раздаем. Без вариантов.\nГотовы работать с поэтапной оплатой (расписано выше)\nПредпочтение отдаем специалистам, имеющим высокую карму на бирже.\nЧасовой пояс - Москва.\nВ Скайп и Телеграм прошу на этапе выбора Исполнителя не приглашать. Спасибо за понимание.\n", "link": "https://freelansim.ru/tasks/261543"},
{"title": "Скрипт на питоне - перебор по циклу и проверка работает ли  интернет", "price": "700 руб. за проект", "description": "Сделать нужно сегодня.\nНа сервисе NORD VPN нужно получить список серверов по списку стран, подключиться к ним и дальше уже будет работать код на селениум.\nКак я вижу решение:\nЕсть всё готовое –\nОно умеет получать список серверов по стране (openpyn US -t 9999 --test) и подключаться к ним (openpyn -s US130 #номер сервера). На debian 10 работает как часики\nЩас в цикле селениум заходит на сайт, нужно, чтобы он делал это под впн.\n1. Получить список серверов страны по списку (openpyn US -t 9999 --test)\n2. Подключиться к #1 серверу из полученного списка (openpyn -s au10 #номер сервера), проверить, что сайт ya.ru доступен, если сайт ya.ru не доступен, то берем #2 серверу\nсервер по списку\n3. Дальше начинает работать селениум\n4. Если происходит исключение при работе селениума (пункт 3), то берем сервер #3\n5. Если селениум отработал штатно, то берем следующий сервер и опять пункт 2.\nЕсли закончились сервера у страны, то берем следующую страну из списка и получаем для неё список серверов (пункт 1)\n\n", "link": "https://freelansim.ru/tasks/261129"},
{"title": "Встроить в сайт код для создания тепловых карт  помещений", "price": "10 000 руб. за проект", "description": "У нас есть код на Python.\nПрограмма запускается и успешно работает на windows. Все исходники есть.\nКод разрабатывал парень, который ушел куда-то на фул тайм и мы перестали работать.\nИспользуются библиотеки OpenCV.\nЧто делает код:\n1. Загружаем видео из помещения (есть в текущем коде)\n2. Загружаем план помещения (есть в текущем коде)\n3. Выбираем интервалы\n4. Настраиваем картинку (есть в текущем коде)\n5. Нажимаем \"Создать тепловую карту\" (есть в текущем коде)\n6. Код с анализирует видео и раз в интервал создает тепловую карту (есть в текущем коде)\n7. Сохраняет gif и jpeg (есть в текущем коде, кроме gif)\n8. Удаляет исходники видео (есть в текущем коде)\nУ нас команда из 6 человек, ищем еще талантливого партнера.\nВажно:\nЯ очень придирчиво выбираю разработчика.\nРаботаю только только с системными людьми и которые умеют контролировать свои эмоции.\nВажна личная встреча и ссылки на соцсети. Если готовы - вы в команде.\n\n", "link": "https://freelansim.ru/tasks/261131"},
{"title": "Разработать краулер для сбора отзывов из картографических источников: 2GIS, Google Maps, Yandex.Maps,  TripAdvisor", "price": "Цена договорная", "description": "Техническое задание в приложении\n", "link": "https://freelansim.ru/tasks/258307"},
{"title": "Менторить группу студентов онлайн-курса \"Веб-разработка на  Python\"", "price": "20 000 руб. за проект", "description": "Привет!\nДля нашего курса \"Full-stack веб-разработчик на Python\" нам нужен ментор (наставник) для того, чтобы вести студентов от начала до конца. Курс длится 9 месяцев, оплата помесячная.\nВажно, чтобы у вас был опыт разработки коммерческих проектов на Python/Django и знакомство с фронтендом.\nОт ментора нужно 1-2 часа в день чтобы отвечать на вопросы, проводить вебинары, помогать студентам с итоговыми проектами.\nПишите, пожалуйста, мне, я вышлю подробности.\n", "link": "https://freelansim.ru/tasks/261391"},
{"title": "Full-stack  Django/vue", "price": "700 руб.за час", "description": "Добрый день!\n\nЕсть задача сделать аналитическую платформу с дашбордами, анализом данных, выполнением действий тикет менеджментом, и другим функционалом. Преспективное решение сразу в нескольких отрослях.\n\nИщу в команду Middle разработчика на парт-тайм (20 часов в неделю) который будет заинтересован в результате и будет работать со стеком:\nDjango, Django channels, Django Rest Framework, Clickhouse (вторичный) Postgres, Vue.js, pug, babel, webpack.\n\nВерсткой придется заниматься по минимуму, больше работа с Django ORM и vue компонентами.\nУ нас хорошая команда, мы все делаем слаженно, задачи ставятся четко, позитивный настрой и свобода в распределении задач.\n\nСтавка 700р. / час\n", "link": "https://freelansim.ru/tasks/261505"},
{"title": "Проект - сервис по  телеграм", "price": "150 000 руб. за проект", "description": "Начните отклик с текущего дня недели\nНужен сервис по телеге для автоматизации задач.\nМини описание - >\nДля начала работа на удаленке, с перспективой на фулл тайм в офис (Москва)\nПожалуйста трезво оценивайте свои возможности)\nБюджет не финальный, может двигаться в сторону увеличения.\n", "link": "https://freelansim.ru/tasks/261595"},
{"title": "Разработать модуль магазина на существующий сайт  (Django)", "price": "Цена договорная", "description": "Нужен middle/senior разработчик для разработки магазина на Python3 + Django на фултайм (не беспокойте плиз если у вас есть постоянное место работы).\n* Нужен именно разработчик в НАШУ команду, другие команды и компании не интересуют!\nДля выполнения задачи, исполнитель должен удовлетворять следующим требованиям:\n1. Уверенное владение ООП и паттернами проектирования\n2. Знание протокола HTTP/1.1\n3. Опыт работы с RESTful API и фреймворком Django Rest Framework\n4. Уметь писать юнит тесты\n5. Предоставить пример написанного ранее кода\n6. Желание кропотливо и настойчиво доводить работу до конца\n7. Желание развиваться в профессиональном плане\n8. Готовность пройти небольшое собеседование и продемонстрировать ранее написанный код\nПриветствуются:\n1. Знание Linux (Debian/Ubuntu) или других *nix\n2. Опыт работы с Nginx, RabbitMQ, Redis, Celery, Docker\n3. Понимание принципов Agile/Scrum\n4. Знание [R]OLAP, Pandas, ML(Keras, Tensorflow)\nУсловия сотрудничества:\n* 6 часовой рабочий день, 120 часов в месяц\n* Оплата почасовая, загрузка на фултайм\n* Работа в команде, есть ПМ\n* Работаем по Scrum\n* Проекты ведём в GitLab, связь через телеграм\nВ отзыве оставляйте ссылки на ваши примеры кода и желаемый рейт.\n", "link": "https://freelansim.ru/tasks/261499"},
{"title": "Внести изменения в парсер данных на сайте в скрипте на  python", "price": "Цена договорная", "description": "Есть небольшой скрипт, который парсит данные на сайте (несколько чисел) помещает их в массив и дальше выгружает да другой сайт. В верстке сайта 1, с которого парсятся данные, произошли изменения, поэтому скрипт перестал работать. Нужно откорректировать ту часть скрипта, который забирает данные с сайта 1 в соответствии с новой версией сайта.\n", "link": "https://freelansim.ru/tasks/261551"},
{"title": "Разработать ETL-процедуры для веб-аналитики (Phyton, Alteryx,  Knime)", "price": "600 руб.за час", "description": "Необходимо разработать  ETL-процедуры для решения в области веб-аналитики. Технологии Phyton, Alteryx, Knime.\nНаш технологический стек:\nTableau, Alteryx, Vertica, плюс самые разные технологии наших клиентов.\nПришлите свое портфолио проектов с описанием и рассказом о себе (ставка, город, опыт работы, прочие пожелания). Рассматриваются только индивидуальные разработчики, который начнут отклик с цифры четыре. Оплата дважды в месяц. Бюджет рассчитан на 600 рублей в час.\nПо завершению проекта можно обсудить постоянное сотрудничество с ежемесячным фиксом по технической поддержке проекта.\n\n", "link": "https://freelansim.ru/tasks/258561"},
{"title": "Создание веб-сервиса  deeplink", "price": "30 000 руб. за проект", "description": "Необходимо разработать веб-сервис подобный\nи\n\nОсновная задача сервиса - превращать обычную ссылку в deeplink.\nЧто должно быть в MPV:\n1. Личный кабинет вот такого формата (слева несколько пунктов меню, справа экран с информацией. Никаких диаграмм в MVP не надо). При регистрации человеку приходит подтверждение на email, при подходе к конку его тарифа приходит напоминание.\n2. Основной функционал по созданию ссылки deeplink. Для MVP достаточно функционала создания ссылки только для Instagram\n3. Слева обязательно пункт меню со статистикой (никаких красивых диаграмм не надо). Нужна информация о ссылке и кол-ве кликов по ней\n4. Подключенный модуль оплаты\n5. Фронтальная часть будет на Tilda, пока человек на нажмет регистрироваться\n6. В будущем к сервису будут добавляться некоторые возможности, предусмотреть этот нюанс\n7. Мобильная адаптивность личного кабинета\nссылка на ленд\n\n", "link": "https://freelansim.ru/tasks/261651"}
]